ahtn/keyplus/ports/efm8/efm8/mcu/C8051F388/inc/SI_C8051F388_Register_Enums.h
#define SMB1CF_INH__BMASK               0x40 ///< SMBus Slave Inhibit                              
#define SMB1CF_INH__SHIFT               0x06 ///< SMBus Slave Inhibit                              
#define SMB1CF_INH__SLAVE_ENABLED       0x00 ///< Slave states are enabled.                        
#define SMB1CF_INH__SLAVE_DISABLED      0x40 ///< Slave states are inhibited.                      
                                                                                                   
#define SMB1CF_ENSMB__BMASK             0x80 ///< SMBus Enable                                     
#define SMB1CF_ENSMB__SHIFT             0x07 ///< SMBus Enable                                     
#define SMB1CF_ENSMB__DISABLED          0x00 ///< Disable the SMBus module.                        
#define SMB1CF_ENSMB__ENABLED           0x80 ///< Enable the SMBus module.                         
                                                                                                   
//------------------------------------------------------------------------------
// SMB1CN Enums (SMBus 1 Control @ 0xC0)
//------------------------------------------------------------------------------
#define SMB1CN_SI__BMASK           0x01 ///< SMBus Interrupt Flag                           
#define SMB1CN_SI__SHIFT           0x00 ///< SMBus Interrupt Flag                           
#define SMB1CN_SI__NOT_SET         0x00 ///<                                                
#define SMB1CN_SI__SET             0x01 ///<                                                
                                                                                            
#define SMB1CN_ACK__BMASK          0x02 ///< SMBus Acknowledge                              
#define SMB1CN_ACK__SHIFT          0x01 ///< SMBus Acknowledge                              
#define SMB1CN_ACK__NOT_SET        0x00 ///< Generate a NACK, or the response was a NACK.   
#define SMB1CN_ACK__SET            0x02 ///< Generate an ACK, or the response was an ACK.   
                                                                                            
#define SMB1CN_ARBLOST__BMASK      0x04 ///< SMBus Arbitration Lost Indicator               
#define SMB1CN_ARBLOST__SHIFT      0x02 ///< SMBus Arbitration Lost Indicator               
#define SMB1CN_ARBLOST__NOT_SET    0x00 ///< No arbitration error.                          
#define SMB1CN_ARBLOST__ERROR      0x04 ///< Arbitration error occurred.                    
                                                                                            
#define SMB1CN_ACKRQ__BMASK        0x08 ///< SMBus Acknowledge Request                      
#define SMB1CN_ACKRQ__SHIFT        0x03 ///< SMBus Acknowledge Request                      
#define SMB1CN_ACKRQ__NOT_SET      0x00 ///< No ACK requested.                              
#define SMB1CN_ACKRQ__REQUESTED    0x08 ///< ACK requested.                                 
                                                                                            
#define SMB1CN_STO__BMASK          0x10 ///< SMBus Stop Flag                                
#define SMB1CN_STO__SHIFT          0x04 ///< SMBus Stop Flag                                
#define SMB1CN_STO__NOT_SET        0x00 ///< A STOP is not pending.                         
#define SMB1CN_STO__SET            0x10 ///< Generate a STOP or a STOP is currently pending.
                                                                                            
#define SMB1CN_STA__BMASK          0x20 ///< SMBus Start Flag                               
#define SMB1CN_STA__SHIFT          0x05 ///< SMBus Start Flag                               
#define SMB1CN_STA__NOT_SET        0x00 ///< A START was not detected.                      
#define SMB1CN_STA__SET            0x20 ///< Generate a START, repeated START, or a START is
                                        ///< currently pending.                             
                                                                                            
#define SMB1CN_TXMODE__BMASK       0x40 ///< SMBus Transmit Mode Indicator                  
#define SMB1CN_TXMODE__SHIFT       0x06 ///< SMBus Transmit Mode Indicator                  
#define SMB1CN_TXMODE__RECEIVER    0x00 ///< SMBus in Receiver Mode.                        
#define SMB1CN_TXMODE__TRANSMITTER 0x40 ///< SMBus in Transmitter Mode.                     
                                                                                            
#define SMB1CN_MASTER__BMASK       0x80 ///< SMBus Master/Slave Indicator                   
#define SMB1CN_MASTER__SHIFT       0x07 ///< SMBus Master/Slave Indicator                   
#define SMB1CN_MASTER__SLAVE       0x00 ///< SMBus operating in slave mode.                 
#define SMB1CN_MASTER__MASTER      0x80 ///< SMBus operating in master mode.                
                                                                                            
//------------------------------------------------------------------------------
// SMB1DAT Enums (SMBus 1 Data @ 0xC2)
//------------------------------------------------------------------------------
#define SMB1DAT_SMB1DAT__FMASK 0xFF ///< SMBus 1 Data
#define SMB1DAT_SMB1DAT__SHIFT 0x00 ///< SMBus 1 Data
                                                     
//------------------------------------------------------------------------------
// SMBTC Enums (SMBus Timing and Pin Control @ 0xB9)
//------------------------------------------------------------------------------
#define SMBTC_SMB0SDD__FMASK         0x03 ///< SMBus 0 Start Detection Window                   
#define SMBTC_SMB0SDD__SHIFT         0x00 ///< SMBus 0 Start Detection Window                   
#define SMBTC_SMB0SDD__NONE          0x00 ///< No additional hold time window (0-1 SYSCLK).     
#define SMBTC_SMB0SDD__ADD_2_SYSCLKS 0x01 ///< Increase hold time window to 2-3 SYSCLKs.        
#define SMBTC_SMB0SDD__ADD_4_SYSCLKS 0x02 ///< Increase hold time window to 4-5 SYSCLKs.        
#define SMBTC_SMB0SDD__ADD_8_SYSCLKS 0x03 ///< Increase hold time window to 8-9 SYSCLKs.        
                                                                                                
#define SMBTC_SMB1SDD__FMASK         0x0C ///< SMBus 1 Start Detection Window                   
#define SMBTC_SMB1SDD__SHIFT         0x02 ///< SMBus 1 Start Detection Window                   
#define SMBTC_SMB1SDD__NONE          0x00 ///< No additional hold time requirement (0-1 SYSCLK).
#define SMBTC_SMB1SDD__ADD_2_SYSCLKS 0x04 ///< Increase hold time window to 2-3 SYSCLKs.        
#define SMBTC_SMB1SDD__ADD_4_SYSCLKS 0x08 ///< Increase hold time window to 4-5 SYSCLKs.        
#define SMBTC_SMB1SDD__ADD_8_SYSCLKS 0x0C ///< Increase hold time window to 8-9 SYSCLKs.        
                                                                                                
//------------------------------------------------------------------------------
// SPI0CFG Enums (SPI0 Configuration @ 0xA1)
//------------------------------------------------------------------------------
#define SPI0CFG_RXBMT__BMASK                0x01 ///< Receive Buffer Empty                              
#define SPI0CFG_RXBMT__SHIFT                0x00 ///< Receive Buffer Empty                              
#define SPI0CFG_RXBMT__NOT_SET              0x00 ///< New data is available in the receive buffer (Slave
                                                 ///< mode).                                            
#define SPI0CFG_RXBMT__SET                  0x01 ///< No new data in the receive buffer (Slave mode).   
                                                                                                        
