ahtn/keyplus/ports/efm8/efm8/mcu/C8051F388/inc/SI_C8051F388_Register_Enums.h
#define SCON1_OVR__BMASK            0x80 ///< Receive FIFO Overrun Flag                         
#define SCON1_OVR__SHIFT            0x07 ///< Receive FIFO Overrun Flag                         
#define SCON1_OVR__NOT_SET          0x00 ///< Receive FIFO overrun has not occurred.            
#define SCON1_OVR__SET              0x80 ///< Receive FIFO overrun has occurred.                
                                                                                                
//------------------------------------------------------------------------------
// SMOD1 Enums (UART1 Mode @ 0xE5)
//------------------------------------------------------------------------------
#define SMOD1_SBL__BMASK          0x01 ///< Stop Bit Length                                 
#define SMOD1_SBL__SHIFT          0x00 ///< Stop Bit Length                                 
#define SMOD1_SBL__SHORT          0x00 ///< Short: Stop bit is active for one bit time.     
#define SMOD1_SBL__LONG           0x01 ///< Long: Stop bit is active for two bit times (data
                                       ///< length = 6, 7, or 8 bits) or 1.5 bit times (data
                                       ///< length = 5 bits).                               
                                                                                            
#define SMOD1_XBE__BMASK          0x02 ///< Extra Bit Enable                                
#define SMOD1_XBE__SHIFT          0x01 ///< Extra Bit Enable                                
#define SMOD1_XBE__DISABLED       0x00 ///< Disable the extra bit.                          
#define SMOD1_XBE__ENABLED        0x02 ///< Enable the extra bit.                           
                                                                                            
#define SMOD1_SDL__FMASK          0x0C ///< Data Length                                     
#define SMOD1_SDL__SHIFT          0x02 ///< Data Length                                     
#define SMOD1_SDL__5_BITS         0x00 ///< 5 bits.                                         
#define SMOD1_SDL__6_BITS         0x04 ///< 6 bits.                                         
#define SMOD1_SDL__7_BITS         0x08 ///< 7 bits.                                         
#define SMOD1_SDL__8_BITS         0x0C ///< 8 bits.                                         
                                                                                            
#define SMOD1_PE__BMASK           0x10 ///< Parity Enable                                   
#define SMOD1_PE__SHIFT           0x04 ///< Parity Enable                                   
#define SMOD1_PE__PARITY_DISABLED 0x00 ///< Disable hardware parity.                        
#define SMOD1_PE__PARITY_ENABLED  0x10 ///< Enable hardware parity.                         
                                                                                            
#define SMOD1_SPT__FMASK          0x60 ///< Parity Type                                     
#define SMOD1_SPT__SHIFT          0x05 ///< Parity Type                                     
#define SMOD1_SPT__ODD_PARTY      0x00 ///< Odd.                                            
#define SMOD1_SPT__EVEN_PARITY    0x20 ///< Even.                                           
#define SMOD1_SPT__MARK_PARITY    0x40 ///< Mark.                                           
#define SMOD1_SPT__SPACE_PARITY   0x60 ///< Space.                                          
                                                                                            
#define SMOD1_MCE__BMASK          0x80 ///< Multiprocessor Communication Enable             
#define SMOD1_MCE__SHIFT          0x07 ///< Multiprocessor Communication Enable             
#define SMOD1_MCE__MULTI_DISABLED 0x00 ///< RI will be activated if the stop bits are 1.    
#define SMOD1_MCE__MULTI_ENABLED  0x80 ///< RI will be activated if the stop bits and extra 
                                       ///< bit are 1. The extra bit must be enabled using  
                                       ///< XBE.                                            
                                                                                            
//------------------------------------------------------------------------------
// VDM0CN Enums (VDD Supply Monitor Control @ 0xFF)
//------------------------------------------------------------------------------
#define VDM0CN_VDDSTAT__BMASK     0x40 ///< VDD Status                                   
#define VDM0CN_VDDSTAT__SHIFT     0x06 ///< VDD Status                                   
#define VDM0CN_VDDSTAT__VDD_BELOW 0x00 ///< VDD is at or below the VDD monitor threshold.
#define VDM0CN_VDDSTAT__VDD_ABOVE 0x40 ///< VDD is above the VDD monitor threshold.      
                                                                                         
#define VDM0CN_VDMEN__BMASK       0x80 ///< VDD Monitor Enable                           
#define VDM0CN_VDMEN__SHIFT       0x07 ///< VDD Monitor Enable                           
#define VDM0CN_VDMEN__DISABLED    0x00 ///< Disable the VDD Monitor.                     
#define VDM0CN_VDMEN__ENABLED     0x80 ///< Enable the VDD Monitor.                      
                                                                                         
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_REFBE__BMASK    0x01 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__SHIFT    0x00 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__DISABLED 0x00 ///< Disable the internal reference buffer.            
#define REF0CN_REFBE__ENABLED  0x01 ///< Enable the internal reference buffer. The internal
                                    ///< voltage reference is driven on the VREF pin.      
                                                                                           
#define REF0CN_BIASE__BMASK    0x02 ///< Internal Analog Bias Generator Enable             
#define REF0CN_BIASE__SHIFT    0x01 ///< Internal Analog Bias Generator Enable             
#define REF0CN_BIASE__DISABLED 0x00 ///< Disable the internal bias generator.              
#define REF0CN_BIASE__ENABLED  0x02 ///< Enable the internal bias generator.               
                                                                                           
#define REF0CN_TEMPE__BMASK    0x04 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__SHIFT    0x02 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__DISABLED 0x00 ///< Disable the internal Temperature Sensor.          
#define REF0CN_TEMPE__ENABLED  0x04 ///< Enable the internal Temperature Sensor.           
                                                                                           
